import * as yup from "yup";

export const userInfoValidation = yup.object({
    username: yup.string().min(3, "نام کاربری شامل 3 تا 30 کاراکتر است").max(30,"نام کاربری شامل 3 تا 30 کاراکتر است").matches(/^[a-zA-Z][a-zA-Z0-9]{2,}$/,"نام کاربری باید با حروف انگلیسی شروع شود"),
})

export const changePasswordValidation = yup.object({
    password: yup.string().min(8, "رمز عبور باید حداقل 8 کاراکتر باشد").max(20, "رمز عبور باید حداکثر 20 کاراکتر باشد").matches(/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/, "رمزعبور باید شامل حروف کوچک و بزرگ انگلیسی،اعداد و نشانه های خاص باشد").required("رمز عبور فعلی خود را وارد کنید"),
    newPassword: yup.string().min(8, "رمز عبور باید حداقل 8 کاراکتر باشد").max(20, "رمز عبور باید حداکثر 20 کاراکتر باشد").matches(/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/, "رمزعبور باید شامل حروف کوچک و بزرگ انگلیسی،اعداد و نشانه های خاص باشد").required("رمز عبور جدید خود را وارد کنید"),
    confirmPassword: yup.string().min(8).max(20).matches(/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/).oneOf([yup.ref("newPassword"), null], "رمز عبور جدید با تکرار آن مطابقت ندارد").required("رمز عبور جدید خود را تکرار کنید"),
})